{"_id": "first-meeting-deck-release-20", "_type": "catalogEntry", "title": "First Meeting Deck Release 2.0", "slug": {"_type": "slug", "current": "first-meeting-deck-release-20"}, "description": "Introduction to the updated First Meeting \"mega deck\" - a comprehensive, approved resource for initial prospect presentations. Learn about the deck's structure, the AI-forward company narrative, available vertical kits, and best practices for customization and battle testing.", "cardType": "enablement-article", "pageTemplate": "playbook", "format": "article", "publishDate": "2025-11-20T00:00:00.000Z", "duration": "30 min", "difficulty": "intermediate", "presenter": "Christian Shockley, Steve West, Emilio Di Zazzo", "status": "published", "publishedTo": ["enablement"], "featured": true, "priority": 90, "articleSections": [{"_key": "howto1", "heading": "Think of it Like Cleats", "content": "The deck is meant to be \"scuffed up\" - customize aggressively and share feedback on what lands with Christian, Steve, and Austin."}, {"_key": "howto2", "heading": "Use Command+F", "content": "Navigate the 150+ slides quickly. No need to memorize locations - search for keywords to find exactly what you need."}, {"_key": "howto3", "heading": "Vertical Kits Available", "content": "Industry-matching product images and use cases for travel/hospitality, telecommunications, QSR, retail, and more."}, {"_key": "howto4", "heading": "Deck Structure", "content": "Primary narrative section (POV, solution, core features), additional slides arsenal, and vertical kits for specific industries."}, {"_key": "howto5", "heading": "The AI-Forward Narrative", "content": "Gladly is transitioning from a \"hero-heavy\" company to an \"AI-forward\" company. The deck supports both existing and new narrative during this transition. Use slides that resonate with your prospect's current stage in their AI journey."}], "keyTakeaways": ["New: AI-Forward Company Narrative - New positioning reflecting Gladly's transition to an AI-forward company, with updated POV slides and messaging framework.", "Updated: Vertical Kits Expanded - Added new industry-specific slides for telecommunications and QSR with matching product images and use cases.", "Coming Soon: Architecture & Model Enablement - Everly is currently refining materials covering underlying model architecture and technical enablement content.", "Coming Soon: Late November GTM Narrative Update - Watch for deck updates in late November/early December reflecting the new GTM narrative and sidekick standalone messaging refinements."], "actionItems": ["Download and familiarize yourself with the First Meeting Deck 2.0 from the provided slides link", "Tag Christian Shockley, Steve West, and Austin when you use customized versions to help the team understand what content lands", "Use Command+F to navigate the deck quickly - no need to memorize slide locations", "SMB team members (Christine, Karl Rehfuss): Provide feedback on modifications needed for hero-pitching scenarios", "Share your perspective on which slides land well and which don't - this helps refine the sidekick standalone messaging", "Watch for updates to the deck in late November/early December reflecting the new GTM narrative", "Participate in upcoming continued training sessions with Emily and Gina"], "resourceLinks": {"videoUrl": "https://drive.google.com/file/d/1234567890/view", "slidesUrl": "https://docs.google.com/presentation/d/first-meeting-deck-2024/edit"}, "modules": [{"_key": "module1", "moduleNumber": 1, "title": "First Meeting Deck Walkthrough", "description": "Overview of the mega deck structure and navigation, how to customize for different audiences, and best practices for using vertical kits.", "videoUrl": "https://drive.google.com/file/d/deck-walkthrough/view", "duration": "30 min"}, {"_key": "module2", "moduleNumber": 2, "title": "AI-Forward Positioning Workshop", "description": "The hero-heavy to AI-forward transition, when to use which narrative approach, and upcoming agenda proposals from Christian.", "videoUrl": "https://drive.google.com/file/d/narrative-deepdive/view", "duration": "45 min"}], "enablementCategory": ["Learning", "Toolkit"]}
