{"_type":"catalogEntry","_id":"first-meeting-deck-release-20","title":"First Meeting Deck Release 2.0","slug":{"_type":"slug","current":"first-meeting-deck-release-20"},"description":"Introduction to the updated First Meeting \"mega deck\" - a comprehensive, approved resource for initial prospect presentations. Learn about the deck's structure, the AI-forward company narrative, available vertical kits, and best practices for customization and battle testing.","cardType":"enablement","pageTemplate":"training-session","publishedTo":["enablement"],"publishDate":"2025-11-21","enablementCategory":"pre-sales","status":"published","priority":80,"presenter":"Christian Shockley, Steve West, Emilio Di Zazzo","duration":"30 min","mainContent":{"videoUrl":"https://drive.google.com/file/d/1kvznmHGjzOOgQqDmybvUA0F87CC9uuxb/view?usp=drive_web"},"resourceLinks":{"videoUrl":"https://drive.google.com/file/d/1kvznmHGjzOOgQqDmybvUA0F87CC9uuxb/view?usp=drive_web","transcriptUrl":"https://docs.google.com/document/d/1WEWwQ9h5pXBNnOR8a9V64oMDmvaMe-SLlCMco4jDX8Q/edit?usp=meet_tnfm_calendar"},"keyAssets":[{"_type":"reference","_ref":"first-meeting-deck-content"}],"keyTakeaways":["The First Meeting Deck 2.0 is a comprehensive 'mega deck' of approved resources - use it as your single source for slides, eliminating the need to search Slack","Think of the deck like cleats meant to be 'scuffed up' - customize aggressively and share feedback on what lands with Christian, Steve, and Austin","Gladly is transitioning from a 'hero-heavy' company to an 'AI-forward' company - the deck supports both existing and new narrative during this transition","The deck contains: primary narrative section (POV, solution, core features), an arsenal of additional slides, and vertical kits for specific industries","Vertical kits include industry-matching product images and use case slides for travel/hospitality, telecommunications, quick service restaurants, etc.","Use Command+F (or Ctrl+F) to quickly search within the deck for specific content","Christian Shockley now owns the series and will circulate proposed agendas; upcoming continued training sessions with Emily and Gina","More architecture and underlying model enablement is coming - Everly is currently refining these materials"],"actionItems":["Download and familiarize yourself with the First Meeting Deck 2.0 from the provided slides link","Tag Christian Shockley, Steve West, and Austin when you use customized versions to help the team understand what content lands","Use Command+F to navigate the deck quickly - no need to memorize slide locations","SMB team members (Christine, Karl Rehfuss): Provide feedback on modifications needed for hero-pitching scenarios","Share your perspective on which slides land well and which don't - this helps refine the sidekick standalone messaging","Watch for updates to the deck in late November/early December reflecting the new GTM narrative","Participate in upcoming continued training sessions with Emily and Gina"],"articleSections":[{"_key":"overview","heading":"What is the First Meeting Deck?","content":"The First Meeting Deck 2.0 is a comprehensive \"mega deck\" of resources intended for your initial pitch of Gladly, whether presenting to a small audience or a full buying committee.\n\n**Key characteristics:**\n- **Comprehensive resource** - Potentially growing to 150+ slides\n- **Flexible usage** - Pull 8-20 slides for any meeting\n- **Approved source** - The single source of truth for slides\n- **Version tracked** - Release numbers clearly marked in the title\n\nNo more searching Slack or waiting for announcements - everything you need is in this deck."},{"_key":"structure","heading":"Deck Structure","content":"**Primary Narrative Section:**\n- Point of View (POV) slides\n- Solution overview\n- Core features\n\n**Arsenal of Additional Slides:**\n- Additional imagery options\n- Architecture slides\n- Social proof template with all case studies\n\n**Vertical Kits:**\n- Industry-matching product images\n- Use case slides developed for each target vertical:\n  - Travel & Hospitality\n  - Telecommunications\n  - Quick Service Restaurants\n  - And more..."},{"_key":"narrative","heading":"The Narrative Transition","content":"Gladly is currently experiencing an \"identity crisis\" - transitioning from a **hero-heavy company** to an **AI-forward company**.\n\nThe deck is designed to support both:\n- The existing narrative while the company finalizes the new pitch\n- The evolving story as we become more AI-forward\n\nThis transition will be reflected in deck updates coming in late November or early December, following the GTM all hands meeting."},{"_key":"usage","heading":"How to Use the Deck","content":"**Think of it like cleats, not Gucci loafers:**\n- Meant to be \"scuffed up\" and customized\n- Tailor it aggressively for your specific meetings\n- Don't treat it as precious - make it your own\n\n**Navigation Tips:**\n- Use Command+F (Mac) or Ctrl+F (Windows) to search within the deck\n- A guide book slide for navigation may be added in future versions\n\n**Feedback Loop:**\nTag Christian Shockley, Steve West, and Austin when sharing customized versions so the team can:\n- Understand what content lands\n- Refine sidekick standalone messaging\n- Improve the deck iteratively"},{"_key":"upcoming","heading":"Upcoming Enablement","content":"**More Coming Soon:**\n- Architecture and underlying models enablement (Everly currently owns refinement)\n- Additional infrastructure and tech stack content\n- Refined tools for technical conversations\n\n**Training Sessions:**\n- Continued training with Emily and Gina\n- Comp plan updates from Jenny B and team (may include office hours)\n- Christian Shockley will circulate proposed agendas for the series"}]}
