{"_type":"catalogEntry","_id":"enable-sales-launch","title":"Sidekick Sales Launch Enablement","slug":{"_type":"slug","current":"sidekick-sales-launch-enablement"},"description":"Comprehensive launch training for Sidekick Sales, covering what it is, how it works, competitive positioning, go-to-market strategy, and available sales assets. Learn how to position Sidekick Sales as a solution that turns every conversation into a revenue opportunity.","cardType":"enablement","pageTemplate":"training-session","publishedTo":["enablement"],"publishDate":"2025-09-15","enablementCategory":"product","status":"published","priority":50,"presenter":"Austin Reece, Kyle Kacius, Gina Vivar","duration":"60 min","mainContent":{"videoUrl":"https://drive.google.com/file/d/1Eh6k62DgAvcVmlaKwvg3_NlDJT7yJjU5/view?usp=drive_link"},"resourceLinks":{"videoUrl":"https://drive.google.com/file/d/1Eh6k62DgAvcVmlaKwvg3_NlDJT7yJjU5/view?usp=drive_link","slidesUrl":"https://docs.google.com/presentation/d/1tQOXRDoAZl60XkKeP6ctX_Z5fbuPU_Tuk6EeQzvEHmw/edit?usp=drive_link","transcriptUrl":"https://docs.google.com/document/d/1m7qlzfOTFiudzAI8NoW7_H7NHx_vfviR1mdFpX1UCIk/edit?usp=drive_link"},"keyTakeaways":["Sidekick Sales is GA and helps convert hesitant shoppers by increasing average order value without discounting - already 23 customers live and generating revenue","Setup takes less than 20 minutes by pointing Sidekick at your website URL - no product catalog integration required, completely agnostic to e-commerce platform","Web content knowledge sources pull text, images, and PDFs from product pages in real-time to inform customer conversations","Single touchpoint for service and sales creates better customer experience - one continuous conversation with the brand, not separate bots","Competitor positioning: AI shopping assistants (Big Su), AI agents (Sierra), support suites (Zendesk), and product discovery widgets (Nostto, Dynamic Yield)","Key differentiators: fastest launch time, single lifelong conversation, unified sales and service, and proving support is a growth engine not cost center","Focus on customer service leaders as primary buyers now; e-commerce buyer persona unlocks in October with revenue tracking features","New chat experience coming: product images in responses, comparison tables, wider chat interface, modernized UI - available to all customers"],"actionItems":["Review the command of the message guide before your next customer conversation about Sidekick Sales","Focus on customer service leaders as your primary buyer persona - it's an easier conversation based on current functionality","Use the elevator pitch: Support is turning into a revenue driver, conversations are getting more complex, you need a unified solution","Highlight the 55% resolution rate for product questions that Tokovas achieved as social proof","For competitive situations, emphasize setup in minutes, single lifelong conversation, and unified sales/service touchpoint","Access all assets on the revenue enablement microsite under Product > Sidekick Sales","Provide feedback on assets in the ask-enablement channel to help refine messaging"],"articleSections":[{"_key":"overview","heading":"What is Sidekick Sales?","content":"Sidekick Sales is a new set of use cases for Sidekick focused on three core capabilities:\n\n1. **Answering product questions** - Using website content as a knowledge source\n2. **Product recommendations** - AI-powered suggestions based on customer context\n3. **Assisted handoffs** - Providing live agents with product interest and question context\n\nThe solution packages web content knowledge sources, templated guides, and Gladly's existing AI architecture into a single offering targeting customer service and e-commerce leaders."},{"_key":"problem","heading":"The Problem We Solve","content":"E-commerce brands face four key challenges:\n\n- **Plateauing conversion rates** despite optimization efforts\n- **Rising customer acquisition costs** making every visitor more expensive\n- **High cart abandonment** from unanswered product questions\n- **Support seen as a cost center** rather than revenue driver\n\nSidekick Sales addresses these by turning every conversation into an opportunity for revenue, increasing average order value without discounting."},{"_key":"howItWorks","heading":"How It Works","content":"**Web Content as Knowledge Source:**\nPoint Sidekick at your website URL and it reads content from product pages in real-time. The system pulls text, images, and PDFs to inform customer conversations. Completely agnostic to e-commerce platform - works with Shopify, Salesforce Commerce, Adobe, etc.\n\n**Templated Guides:**\nPre-built templates for product questions and recommendations make setup easy. Customers can be live in production in less than 20 minutes.\n\n**Dynamic Content:**\nWhen a consumer asks a question, Sidekick pulls content in real-time, summarizes information from multiple pages, and delivers clear answers - especially important on mobile where attention spans are short."},{"_key":"competitive","heading":"Competitive Landscape","content":"**AI Shopping Assistants** (Big Su, LivePerson, Attentive):\n- Dedicated to shopping/revenue generation\n- Need catalog integrations\n- No customer context\n\n**AI Agents for Service** (Sierra, Decagon, ADA):\n- Focused on deflection\n- Not connected to customer data\n- No shopping focus\n\n**Support Suites** (Zendesk, Intercom):\n- Reactive, not proactive on sales\n- Support as cost center mindset\n\n**Product Discovery Widgets** (Nostto, Dynamic Yield):\n- Static recommendations\n- No conversation capability\n- Limited to on-page behavior\n\n**Gladly's Differentiation:**\n- Fastest to launch (no catalog integration)\n- Single lifelong conversation\n- Unified service + sales\n- Turns support into growth engine"},{"_key":"demo","heading":"Enhanced Chat Experience","content":"The engineering team has built an improved chat experience showcased in the \"kickass demo\":\n\n- **Product images in responses** - Visual engagement keeps consumers more engaged\n- **Comparison tables** - Easy product comparison capability (coming soon)\n- **Wider chat experience** - More engaging on desktop\n- **Modernized interface** - Brand logos, customizable colors\n\nThese improvements will be available to ALL customers, not just those using Sidekick Sales. The vision is a more conversational e-commerce experience where asking questions replaces browsing long product pages."},{"_key":"gtm","heading":"Go-to-Market Strategy","content":"**Current Focus (Now):**\nCustomer service leaders as primary buyers - easier conversation based on current functionality.\n\n**Coming in October:**\n- E-commerce buyer persona unlocked with new features\n- Revenue tracking and attribution\n- E-commerce-specific product features\n- Enhanced demo capabilities\n\n**Elevator Pitch for CS Leaders:**\n\"Support is turning into a revenue driver. Conversations are getting more complex with different touchpoints. You need a single solution that unifies those conversations, recommends products, handles pre-purchase questions, and accelerates live agent handoffs with context.\""}]}
{"_type":"catalogEntry","_id":"unwrap-ai-partnership-enablement","title":"Monthly Partnership Enablement: Unwrap.ai","slug":{"_type":"slug","current":"unwrap-ai-partnership-enablement"},"description":"Partnership enablement for Unwrap.ai, Gladly's new data and analytics partner. Learn how Unwrap uses AI to aggregate unstructured customer feedback from multiple sources and extract granular insights, enabling faster issue detection and voice of customer analysis.","cardType":"enablement","pageTemplate":"training-session","publishedTo":["enablement"],"publishDate":"2025-11-12","enablementCategory":"partner","status":"published","priority":70,"presenter":"Nathan Smith, Ben Altneu, Ryan (Unwrap CEO)","duration":"30 min","keyTakeaways":["Unwrap.ai aggregates unstructured qualitative feedback from multiple sources (Gladly, surveys, social media) and uses AI to extract granular insights automatically","Issue detection is under 1 hour with Unwrap vs. 2 days to 4 weeks previously - proactive alerts within 15 minutes of incidents","Customer service data is the most valued qualitative feedback source - integrating Unwrap makes Gladly stickier at renewal time","Unwrap opportunities between $50K-$250K align with mid-market, $250K+ with enterprise - end-of-year incentives available","No seat-based licensing - any team member can access insights, democratizing data across CX and Product teams","Onboarding takes ~2 weeks total, only ~1 hour of partner time for authentication - no engineering work required","90%+ tagging accuracy with AI vs. 70-72% with manual tagging systems","Mutual customers include DoorDash, Deckers, and similar large brands"],"actionItems":["Listen for customers saying 'I need better insights from my qualitative data' or 'faster issue detection' - that's the trigger for Unwrap","Position Unwrap when competing against all-in-one solutions like Sprinklr or Qualtrics that offer their own analytics","Reference end-of-year incentives for opportunities brought to Unwrap partnership","Join the shared Slack channel for Unwrap.ai to collaborate on opportunities","Target accounts with high product feedback volume (like Restoration Hardware where 90% of issues are product-related)","Highlight that Unwrap eliminates need for agents to manually tag via forms/fields - data is extracted from conversations","Use 'conversational intelligence' and 'voice of customer' as keywords in RFPs and requirements discussions"],"articleSections":[{"_key":"overview","heading":"What is Unwrap.ai?","content":"Unwrap.ai aggregates unstructured qualitative customer feedback from multiple sources and uses AI to extract granular insights automatically.\n\n**Data Sources:**\n- Support systems (Gladly, Zendesk)\n- Surveys (Medallia, Qualtrics, TypeForm, SurveyMonkey)\n- Public sources (Google, Yelp, Reddit, X, G2, BBB)\n\nOn average, customers have 7-10 feedback sources connected."},{"_key":"value","heading":"Why CX Leaders Use Unwrap","content":"**Fast Issue Detection:**\n- Average time to detection under 1 hour (vs. 2 days to 4 weeks previously)\n- Proactive alerts within 15 minutes of incidents\n- Example: DoorDash's team notified within minutes that merchant tablets are down\n\n**Granular Insights:**\n- AI extracts specific details (e.g., \"Hoka shoe laces wearing prematurely\")\n- 90%+ tagging accuracy vs. 70-72% with manual systems\n- Deep taxonomy automatically generated and maintained\n\n**Voice of Customer:**\n- Own the voice of the customer across all channels\n- Build alignment with internal business partners using data-backed insights\n- Democratize insights so Product teams can self-serve"},{"_key":"partnership","heading":"Partnership Value for Gladly","content":"**Compete with All-in-Ones:**\n- Sprinklr and Qualtrics offer their own analytics\n- Unwrap is best-in-class alternative in our stack\n\n**Sticky Product:**\n- When CSMs hear \"I need better insights,\" you have an answer\n- Makes Gladly stickier at renewal time\n\n**Co-Selling:**\n- Grow ACVs by estimated 20-30%\n- End-of-year incentives available\n\n**Market Keywords:**\n- \"Conversational intelligence\"\n- \"Voice of customer\"\n- \"Aggregated insights\""},{"_key":"demo","heading":"Platform Capabilities","content":"**Proactive Alerts:**\n- Automatically categorizes all feedback\n- Detects anomalies and sends alerts\n- Example: \"Damaged packages from FedEx in New York - 88% of complaints despite 5% of feedback\"\n\n**Issue Deep Dives:**\n- Dedicated page for each issue with time series\n- Detailed summary and verbatims\n- Agent resolution paths\n- Links back to original Gladly ticket\n\n**Self-Service (Assistant):**\n- Chatbot for asking questions about feedback\n- Generate visualizations on demand\n- No seat-based licensing - all users have access\n\n**Bot Analysis:**\n- Analyze full bot conversations\n- Identify reasons for escalation to humans"},{"_key":"commercial","heading":"Commercial Details","content":"**Pricing:**\n- Based on feedback volume (not seats)\n\n**Opportunity Tiers:**\n- $50K-$250K: Aligned with mid-market deals\n- $250K+: Enterprise space\n\n**Onboarding:**\n- ~2 weeks total\n- Only ~1 hour of partner time for authentication\n- No engineering work required\n\n**End-of-Year Incentives:**\nAvailable for team members who include Unwrap in opportunities."}]}
{"_type":"catalogEntry","_id":"standalone-sk-demo-figma","title":"Standalone SK Demo (Figma)","slug":{"_type":"slug","current":"standalone-sk-demo-figma"},"description":"Training on new Sidekick Standalone demo materials, including Figma mocks for third-party helpdesk handoffs. Covers the demo flow, ZenDesk handoff capabilities, Sidekick's trust layer architecture, and upcoming demo training track.","cardType":"enablement","pageTemplate":"training-session","publishedTo":["enablement"],"publishDate":"2025-09-15","enablementCategory":"demo-standards","status":"published","priority":70,"presenter":"Steve West, Christian Eberle, Christian Shockley","duration":"30 min","keyTakeaways":["New standalone demo materials including Figma mocks are available on the Sidekick standalone microsite","Demo flow mirrors Ritali Outdoors certification - remove 'hero' portion and insert new helpdesk section","Figma mock shows complete handoff story: automated conversation, escalation detection, transfer to ZenDesk with full transcript and summary","Use Figma demo 99% of the time until live ZenDesk demo is available (ETA: October 1st)","Sidekick's 'trust layer' checks every response for tone, brand alignment, fact-checking, hallucination prevention, and compliance before reaching customer","Architecture remains consistent whether Sidekick operates within Gladly or as standalone - same knowledge sources, guides, and escalation rules","Current demo focus is on ZenDesk, Fresh Chat, Dixa, and Help Scout - Salesforce will take longer due to needing a consultant","Four-to-six week demo training track launching September 29th with modules, expert sessions, and small group practice"],"actionItems":["Access the new Figma demo materials on the Sidekick standalone microsite","Practice the demo flow: Ritali Outdoors certification minus 'hero' portion plus new helpdesk section","Pivot smoothly from Ritali demo to Figma when discussing third-party helpdesk handoff capabilities","Use Figma demo for ZenDesk competitions until live demo environment is ready","Prepare for the demo training track launching September 29th","Complete the pre-training survey (coming from Christian Shockley) to assess familiarity with demo principles","For enterprise integrations with homegrown systems, discuss middleware approach through app platform"],"articleSections":[{"_key":"overview","heading":"Demo Materials Overview","content":"New standalone demo materials are now available on the Sidekick standalone microsite:\n\n- **Figma mocks** for third-party helpdesk portion\n- Demo flow largely mirrors Ritali Outdoors certification\n- Remove the \"hero\" portion and insert new helpdesk section\n\n**Important:** Use the Figma demo 99% of the time until the live ZenDesk demo environment is built (ETA: October 1st)."},{"_key":"figma","heading":"Figma Mock Capabilities","content":"The Figma mock demonstrates a complete handoff story:\n\n1. **New automated conversation** with customer (Julie)\n2. **Sidekick displays information** and responds to queries\n3. **Escalation detection** when transfer is necessary\n4. **ZenDesk interface** receives the conversation with:\n   - Full transcript\n   - Handoff summary\n   - Structured fields populated with customer data\n\nAgents can resolve issues without customers repeating information - maintaining a continuous story."},{"_key":"architecture","heading":"Sidekick Architecture & Trust Layer","content":"**Experience Orchestration:**\nSidekick's underlying architecture remains consistent whether operating:\n- As a full suite within Gladly\n- As a standalone product\n\nSame knowledge sources, guides, escalation rules, and performance insights regardless of platform.\n\n**Trust Layer:**\nEvery Sidekick response undergoes checks for:\n- Tone and brand alignment\n- Fact-checking\n- Hallucination prevention\n- Promise detection\n- Compliance\n- Safety\n\nResponses must pass a confidence threshold. If they fail twice, they're escalated to an agent - ensuring trustworthiness and brand consistency across all channels."},{"_key":"integrations","heading":"Enterprise Integrations","content":"**Current Demo Focus (subset of four):**\n- ZenDesk\n- Fresh Chat\n- Dixa\n- Help Scout\n\n**Coming Later:**\n- Salesforce (needs consultant involvement)\n\n**CCaaS Logos (Genesis, etc.):**\nRepresent ability to hand off voice AI with any provider through simple call forwarding.\n\n**Homegrown/Unarticulated Systems:**\nBuild middleware through the app platform - same approach as existing integrations."},{"_key":"training","heading":"Demo Training Track","content":"**Launching September 29th:**\n- Four-to-six week demo training track\n- Establish common demo principles\n- Build up to full 45-minute demo with Sidekick Standalone focus\n\n**Training Includes:**\n- Modules covering \"under the hood\" technical elements\n- Sessions led by BP and product experts\n- Small group practice sessions with feedback\n\n**Pre-Training Survey:**\nComing from Christian Shockley to gauge familiarity with principles, pitfalls, and desired technical enablement."},{"_key":"routing","heading":"Handoff & Routing Rules","content":"**Responsibility for Routing Rules:**\nThe helpdesk is responsible for routing rules after handoff - anything that would typically happen after Sidekick in Gladly now occurs within the helpdesk.\n\n**Intent Detection:**\n- Sidekick does perform intent recognition to guide actions and outcomes\n- This data is NOT currently exposed to third parties\n- Help desk cannot directly utilize Sidekick's intent data\n\n**Tags & Fields (Coming):**\n- Tags for ZenDesk planned by end of October\n- Ticket fields and forms will NOT be edited\n- MVP release: October 1st"}]}
